<a href="https://colab.research.google.com/github/syaefulalam/office/blob/master/profile%20service%20okt%2019.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd
#Load data
from google.colab import drive
drive.mount('/content/drive', force_remount=True)
transactions = pd.read_csv('/content/drive/My Drive/coba/Profile Msisdn service per Okt 19.csv', engine='python')

Mounted at /content/drive

In [4]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [6]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4992207 entries, 0 to 4992206
Data columns (total 5 columns):
msisdn       object
unit_type    object
unit_name    object
brand        object
age          float64
dtypes: float64(1), object(4)
memory usage: 190.4+ MB

In [0]:
data = transactions.drop_duplicates(subset=['msisdn'])

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2157407 entries, 0 to 4992205
Data columns (total 5 columns):
msisdn       object
unit_type    object
unit_name    object
brand        object
age          float64
dtypes: float64(1), object(4)
memory usage: 98.8+ MB

In [9]:
#Melakukan pengecekan untuk nilai NULL yang ada
print(data.isnull().values.any())

True

In [10]:
data.head()

        msisdn unit_type              unit_name brand  age
0  08111037111     gerai                 CIKUPA   NaN  NaN
2  08113190388   grapari        SURABAYA PEMUDA   NaN  NaN
4  08115940088     gerai  MT HARYONO BALIKPAPAN   NaN  NaN
6  08117160022     gerai              BATU RAJA   NaN  NaN
7  08117166637     gerai              BATU RAJA   NaN  NaN

In [12]:
#will drop all rows in which any null value is present
data.dropna()

                msisdn   unit_type         unit_name      brand   age
32        628111000887  callcenter        CC BANDUNG  kartuHALO  46.0
33        628111000908  callcenter        CC BANDUNG  kartuHALO  54.0
37        628111001013       gerai  KOTA KASABLANKA   kartuHALO  46.0
43        628111001097     grapari           CILEGON  kartuHALO  21.0
45        628111001307  callcenter       CC SURABAYA  kartuHALO  35.0
...                ...         ...               ...        ...   ...
4992185  6285399988321       gerai  MEDAN FAIR PLAZA    kartuAS  42.0
4992187  6285399991996  webservice             eCare    kartuAS  23.0
4992193  6285399992353       gerai             DEMAK    kartuAS  32.0
4992196  6285399993592  callcenter       CC MAKASSAR    kartuAS  28.0
4992198  6285399997729     grapari         PALEMBANG  kartuHALO  29.0

[1471176 rows x 5 columns]

In [13]:
data.describe()

                age
count  1.884347e+06
mean   3.775950e+01
std    1.336588e+01
min   -1.000000e+01
25%    2.800000e+01
50%    3.700000e+01
75%    4.700000e+01
max    8.900000e+01